# Introduction to Pandas

DAMI LAB ASSISTANT

In [2]:
import pandas as pd

### Series 

one dimensional array, kinda

In [3]:
series = pd.Series([1,2,3])

In [4]:
series

0    1
1    2
2    3
dtype: int64

Above, the first column are the indexes, the second column is the values

In [6]:
names = ["a", "b", "c"]
values = [34, 32, 678]
series2 = pd.Series(data=values, index=names, name = "my_serie") # give names to indexes, and name to the whole series

In [7]:
series2

a     34
b     32
c    678
Name: my_serie, dtype: int64

In [8]:
dict = {"a":4, "b":98, "hello":45}
series3 = pd.Series(dict)

In [9]:
series3

a         4
b        98
hello    45
dtype: int64

### Select element from series

In [11]:
series3[1]

98

In [12]:
series3["b"]

98

In [14]:
series3[1:]

b        98
hello    45
dtype: int64

### Data Frame

A sequence of aligned series objects.
Essentially a dataframe is an Array with dynamic row and column indecies

In [15]:
data = {'color' : ['blue', 'green', 'yellow', 'red', 'white'],
'object': ['ball', 'pen', 'pencil', 'paper', 'mug'],
'price': [1.2, 1.0, 0.6, 0.9, 1.7]}

In [19]:
dataframe = pd.DataFrame(data, index=["one", "two", "three", "four", "five"])

In [17]:
dataframe

        color  object  price
one      blue    ball    1.2
two     green     pen    1.0
three  yellow  pencil    0.6
four      red   paper    0.9
five    white     mug    1.7

In [20]:
dataframe["color"]

one        blue
two       green
three    yellow
four        red
five      white
Name: color, dtype: object

In [21]:
dataframe.loc["three"]

color     yellow
object    pencil
price        0.6
Name: three, dtype: object

loc returns a one dimensional array, series, i think. using key / value. iloc[] uses index

In [22]:
dataframe.iloc[2]

color     yellow
object    pencil
price        0.6
Name: three, dtype: object

In [23]:
dataframe.loc[["two", "three"], ["object", "price"]]

       object  price
two       pen    1.0
three  pencil    0.6

In [24]:
dataframe["new"] = dataframe["price"] ** 2

In [25]:
dataframe

        color  object  price   new
one      blue    ball    1.2  1.44
two     green     pen    1.0  1.00
three  yellow  pencil    0.6  0.36
four      red   paper    0.9  0.81
five    white     mug    1.7  2.89

In [26]:
dataframe.drop("new", axis=1, inplace=True) # 0 - for dropping rows, 1 - for dropping columns 
# inplace = True - otherwise changes are just gonna be displayed, not saved

        color  object  price
one      blue    ball    1.2
two     green     pen    1.0
three  yellow  pencil    0.6
four      red   paper    0.9
five    white     mug    1.7

### Conditionals

In [27]:
dataframe[dataframe["price"]<1]

        color  object  price   new
three  yellow  pencil    0.6  0.36
four      red   paper    0.9  0.81

### Concatination

In [28]:
df1 = pd.DataFrame({
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3'],
    'C': ['C0', 'C1', 'C2', 'C3'],
   'D': ['D0', 'D1', 'D2', 'D3']},
    index=[0,1,2,3]
)

df2 = pd.DataFrame({
    'A': ['A4', 'A5', 'A6', 'A7'],
    'B': ['B4', 'B5', 'B6', 'B7'],
    'C': ['C4', 'C5', 'C6', 'C7'],
   'D': ['D4', 'D5', 'D6', 'D7']},
    index=[4,5,6,7]
)

df3 = pd.DataFrame({
    'A': ['A8', 'A9', 'A10', 'A11'],
    'B': ['B8', 'B9', 'B10', 'B11'],
    'C': ['C8', 'C9', 'C10', 'C11'],
   'D': ['D8', 'D9', 'D10', 'D11']},
    index=[8,9,10,11]
)

In [29]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [30]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [31]:
pd.concat([df1,df2,df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [32]:
my_data = pd.concat([df1, df2, df3])

In [33]:
my_data

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [34]:
my_data.to_csv("my_csv.csv") #File will be in current directory